; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-81)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 - object)
 (:init 
    (arm-empty)
    (clear b11)
    (on b11 b20)
    (on b20 b14)
    (on b14 b18)
    (on-table b18)
    (clear b8)
    (on b8 b24)
    (on b24 b1)
    (on-table b1)
    (clear b16)
    (on b16 b2)
    (on b2 b19)
    (on b19 b6)
    (on b6 b12)
    (on b12 b15)
    (on b15 b17)
    (on b17 b4)
    (on-table b4)
    (clear b10)
    (on b10 b22)
    (on b22 b7)
    (on b7 b21)
    (on b21 b9)
    (on b9 b13)
    (on b13 b3)
    (on b3 b23)
    (on b23 b5)
    (on-table b5))
 (:goal (and 
(on-table b1)
(clear b18) (on b18 b10)
))
)

; plan
1. (unstack b11 b20)
   deleted: (on b11 b20) (clear b11) (arm-empty)
   added: (holding b11) (clear b20)
   goals met: 1 of 3
2. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 3
3. (unstack b20 b14)
   deleted: (on b20 b14) (clear b20) (arm-empty)
   added: (holding b20) (clear b14)
   goals met: 1 of 3
4. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 1 of 3
5. (unstack b14 b18)
   deleted: (on b14 b18) (clear b14) (arm-empty)
   added: (holding b14) (clear b18)
   goals met: 2 of 3
6. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 2 of 3
7. (pickup b18)
   deleted: (clear b18) (on-table b18) (arm-empty)
   added: (holding b18)
   goals met: 1 of 3
8. (stack b18 b10)
   deleted: (clear b10) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b10)
   goals met: 3 of 3
